[
  {
    "id": "lateral_0",
    "category": "Lateral Thinking",
    "problem": "A man lives on the 10th floor of a building. Every morning he takes the elevator down to the ground floor to go to work. When he returns in the evening, he takes the elevator to the 7th floor and walks up the stairs to reach his apartment on the 10th floor. However, on rainy days and when there are other people in the elevator, he goes directly to the 10th floor. Why does he do this?"
  },
  {
    "id": "lateral_1",
    "category": "Lateral Thinking",
    "problem": "A woman has two sons who were born on the same day of the same month of the same year to the same mother and father. But they are not twins. How is this possible?"
  },
  {
    "id": "lateral_2",
    "category": "Lateral Thinking",
    "problem": "A man is found dead in a circular room with no windows and only one door, which is locked from the inside. The room is completely empty except for a puddle of water and a small hole in the ceiling. How did he die?"
  },
  {
    "id": "lateral_3",
    "category": "Lateral Thinking",
    "problem": "You are in a room with three light switches, each connected to a light bulb in another room. You cannot see the light bulbs from where the switches are. You can flip the switches as many times as you want, but once you enter the room with the light bulbs, you cannot return to the switches. How do you determine which switch controls which light bulb?"
  },
  {
    "id": "lateral_4",
    "category": "Lateral Thinking",
    "problem": "A father and his son are in a car accident. The father dies on the scene, but the son is rushed to the hospital. At the hospital, the surgeon looks at the boy and says, 'I can't operate on this boy. He's my son.' How is this possible?"
  },
  {
    "id": "lateral_5",
    "category": "Lateral Thinking",
    "problem": "A rope is tied around the Earth at the equator, lying flat against the ground. If you add 1 meter to the length of the rope and space it evenly all the way around, how far off the ground will the rope be?"
  },
  {
    "id": "lateral_6",
    "category": "Lateral Thinking",
    "problem": "Two people enter a bar. They both order the same drink. One person drinks it slowly and survives. The other drinks it quickly and dies. The drinks were identical and weren't poisoned. What were they drinking?"
  },
  {
    "id": "lateral_7",
    "category": "Lateral Thinking",
    "problem": "A man walks into a restaurant, orders albatross soup, takes one taste, and then kills himself. Why?"
  },
  {
    "id": "lateral_8",
    "category": "Lateral Thinking",
    "problem": "A woman gives a beggar 50 cents. The woman is the beggar's sister, but the beggar is not the woman's brother. How is this possible?"
  },
  {
    "id": "lateral_9",
    "category": "Lateral Thinking",
    "problem": "A man is sitting in a pub feeling rather poor. He sees the man next to him pull out a wallet full of money. He decides to steal the wallet. He waits for the man to leave, then follows him out of the pub. Ten minutes later he returns to the pub with a satisfied smile on his face. Why doesn't he have the wallet?"
  },
  {
    "id": "lateral_10",
    "category": "Lateral Thinking",
    "problem": "You're in a dark room with a candle, a wood stove, and a gas lamp. You only have one match. What do you light first?"
  },
  {
    "id": "lateral_11",
    "category": "Lateral Thinking",
    "problem": "A man stood on one side of a river, his dog on the other. The man called his dog, who immediately crossed the river without getting wet and without using a bridge or a boat. How did the dog do it?"
  },
  {
    "id": "lateral_12",
    "category": "Lateral Thinking",
    "problem": "A man pushed his car until he reached a hotel, at which point he realized he was bankrupt. What happened?"
  },
  {
    "id": "lateral_13",
    "category": "Lateral Thinking",
    "problem": "A woman had two sons who were born on the same hour of the same day of the same year. But they were not twins and they were not adopted. How could this be?"
  },
  {
    "id": "lateral_14",
    "category": "Lateral Thinking",
    "problem": "A window cleaner is cleaning the windows on the 25th floor of a skyscraper when he slips and falls. He has no safety equipment and nothing to break his fall, but he is not hurt. How is this possible?"
  },
  {
    "id": "lateral_15",
    "category": "Lateral Thinking",
    "problem": "A girl who was just learning to drive went down a one-way street in the wrong direction, but didn't break the law. How is this possible?"
  },
  {
    "id": "lateral_16",
    "category": "Lateral Thinking",
    "problem": "There is a house with four walls. Each wall faces south. A bear walks by the house. What color is the bear?"
  },
  {
    "id": "lateral_17",
    "category": "Lateral Thinking",
    "problem": "A truck driver is going down a one-way street the wrong way, and passes at least ten police officers. None of them stop him. Why not?"
  },
  {
    "id": "lateral_18",
    "category": "Lateral Thinking",
    "problem": "A boat has a ladder that has 5 rungs. The distance between each rung is 20 cm. The bottom rung is 20 cm from the water level. The tide rises at 15 cm per hour. How long will it take for the water to reach the top rung?"
  },
  {
    "id": "lateral_19",
    "category": "Lateral Thinking",
    "problem": "A murderer is condemned to death. He has to choose between three rooms. The first is full of raging fires, the second is full of assassins with loaded guns, and the third is full of lions that haven't eaten in 3 years. Which room should he choose?"
  },
  {
    "id": "lateral_20",
    "category": "Lateral Thinking",
    "problem": "Every day, a man crosses the border from Mexico into the United States on a bicycle, carrying a bag of sand. The customs officer checks the bag, finds nothing but sand, and lets him through. Weeks later, the officer discovers the man has been smuggling something. What was he smuggling?"
  },
  {
    "id": "lateral_21",
    "category": "Lateral Thinking",
    "problem": "A man is trapped in a room. The room has only two possible exits: two doors. Through the first door, there is a room constructed from magnifying glass. The blazing hot sun instantly fries anything or anyone that enters. Through the second door, there is a fire-breathing dragon. How does the man escape?"
  },
  {
    "id": "lateral_22",
    "category": "Lateral Thinking",
    "problem": "A man is found hanging dead from the ceiling in a locked room with a puddle of water beneath him. There is no furniture in the room. How did he kill himself?"
  },
  {
    "id": "lateral_23",
    "category": "Lateral Thinking",
    "problem": "A man kills his wife, then goes into his house and has a meal. Later, the police come, and he freely admits to the murder, but they can't arrest him. Why not?"
  },
  {
    "id": "lateral_24",
    "category": "Lateral Thinking",
    "problem": "A woman shoots her husband, then holds him underwater for five minutes. Next, she hangs him. Right after, they enjoy a lovely dinner. How is this possible?"
  },
  {
    "id": "lateral_25",
    "category": "Lateral Thinking",
    "problem": "You are given 8 balls. 7 of them weigh the same, and 1 of them weighs slightly more. How can you find the ball that is heavier by using a balance and only 2 weighings?"
  },
  {
    "id": "lateral_26",
    "category": "Lateral Thinking",
    "problem": "A man walks into a bar and asks for a glass of water. The bartender pulls out a gun and points it at him. The man says 'Thank you' and walks out. What happened?"
  },
  {
    "id": "lateral_27",
    "category": "Lateral Thinking",
    "problem": "A prisoner is told, 'If you tell a lie, we will hang you and if you tell the truth, we will shoot you.' What can the prisoner say to save himself?"
  },
  {
    "id": "lateral_28",
    "category": "Lateral Thinking",
    "problem": "A man orders a meal in a restaurant and when it arrives, he says 'I can't eat this!' Then he leaves without eating or paying. Yet the waiter is not upset and the man has done nothing wrong. Why?"
  },
  {
    "id": "lateral_29",
    "category": "Lateral Thinking",
    "problem": "Two mothers and two daughters went out to eat. Everyone ate one burger, yet only three burgers were eaten in total. How is this possible?"
  },
  {
    "id": "lateral_30",
    "category": "Lateral Thinking",
    "problem": "A woman enters a library and asks for a book about Pavlov's dogs and Schrödinger's cat. The librarian says, 'It rings a bell, but I'm not sure if it's there or not.' Why is this funny?"
  },
  {
    "id": "lateral_31",
    "category": "Lateral Thinking",
    "problem": "A man and his wife race through a door, and the man comes in first. But the wife arrives before her husband. How is this possible?"
  },
  {
    "id": "lateral_32",
    "category": "Lateral Thinking",
    "problem": "A man took a picture of his son. How is it possible that his son has been deceased for over 100 years?"
  },
  {
    "id": "lateral_33",
    "category": "Lateral Thinking",
    "problem": "A man in a small town married 20 different women from the same town. All of them are still living and he never divorced any of them. Yet he broke no laws. How is this possible?"
  },
  {
    "id": "lateral_34",
    "category": "Lateral Thinking",
    "problem": "You are in a room with no doors or windows. The only things in the room are a table and a mirror. How do you get out?"
  },
  {
    "id": "lateral_35",
    "category": "Lateral Thinking",
    "problem": "A woman gave birth to two boys on the same day in the same year, but they weren't twins. How is this possible?"
  },
  {
    "id": "lateral_36",
    "category": "Lateral Thinking",
    "problem": "A perfectly cylindrical hole is drilled straight through the center of a sphere. The hole is 6 inches long. What is the volume of the remaining portion of the sphere?"
  },
  {
    "id": "lateral_37",
    "category": "Lateral Thinking",
    "problem": "Three doctors said that Bill is their brother. Bill says he has no brothers. Who is telling the truth?"
  },
  {
    "id": "lateral_38",
    "category": "Lateral Thinking",
    "problem": "A man is found dead on a Sunday morning. His wife calls the police immediately. The police question the wife and staff. The wife said she was asleep, the cook was cooking breakfast, the gardener was picking vegetables, the maid was cleaning, and the butler was getting the mail. The police immediately arrested the killer. Who was it?"
  },
  {
    "id": "lateral_39",
    "category": "Lateral Thinking",
    "problem": "A man and his son are in a car crash. The father dies at the scene and the son is rushed to the hospital. At the hospital, the surgeon looks at the boy and says 'I can't operate on this boy, he's my son.' How can this be?"
  },
  {
    "id": "lateral_40",
    "category": "Lateral Thinking",
    "problem": "When Bob entered the room, he felt instant dread. There were 53 bicycles and calendars on the wall. What profession does Bob have?"
  },
  {
    "id": "lateral_41",
    "category": "Lateral Thinking",
    "problem": "A man is facing east. He turns 90 degrees to his right, then another 180 degrees to the right, and then 90 degrees to his left. In which direction is he facing now?"
  },
  {
    "id": "lateral_42",
    "category": "Lateral Thinking",
    "problem": "Two women apply for a job. They are identical in appearance, background, and experience. The manager hires one and rejects the other. This is not discrimination. Why did the manager choose one over the other?"
  },
  {
    "id": "lateral_43",
    "category": "Lateral Thinking",
    "problem": "A man builds a rectangular house. All four sides have a southern exposure. A bear walks by. What color is the bear?"
  },
  {
    "id": "lateral_44",
    "category": "Lateral Thinking",
    "problem": "Five pieces of coal, a carrot, and a scarf are lying on the lawn. Nobody put them on the lawn, but there is a perfectly logical reason why they are there. What is it?"
  },
  {
    "id": "lateral_45",
    "category": "Lateral Thinking",
    "problem": "Without using a calculator, determine which is greater: 50^99 or 99^50?"
  },
  {
    "id": "lateral_46",
    "category": "Lateral Thinking",
    "problem": "Two boxers are in a match scheduled for 12 rounds. One of the boxers gets knocked out after 6 rounds, yet no man throws a punch. How is this possible?"
  },
  {
    "id": "lateral_47",
    "category": "Lateral Thinking",
    "problem": "A man leaves a motel, goes to his car, and honks the horn. Why did he do that?"
  },
  {
    "id": "lateral_48",
    "category": "Lateral Thinking",
    "problem": "A woman was born in 2020, but in 2023 she turned 25. How is this possible?"
  },
  {
    "id": "lateral_49",
    "category": "Lateral Thinking",
    "problem": "You enter a dark room. You have one match. There is a candle, an oil lamp, and a wood-burning stove in the room. Which one do you light first?"
  },
  {
    "id": "lateral_50",
    "category": "Lateral Thinking",
    "problem": "A man is washing windows on a high-rise building when he slips and falls. He is not wearing a safety harness and nothing breaks his fall, yet he survives without any injuries. How?"
  },
  {
    "id": "lateral_51",
    "category": "Lateral Thinking",
    "problem": "You have a drawer with 10 blue socks and 10 black socks mixed up. It is completely dark, and you need a matching pair. What is the minimum number of socks you need to take out to ensure you have a matching pair?"
  },
  {
    "id": "lateral_52",
    "category": "Lateral Thinking",
    "problem": "A man is standing outside a building. He jumps from the building's 50th floor but survives with no injuries. How is this possible?"
  },
  {
    "id": "lateral_53",
    "category": "Lateral Thinking",
    "problem": "A woman buys a brand new car, drives it for 100 miles, then sells it. The person who buys it drives it for another 100 miles before selling it back to the original dealer. When the dealer checks the odometer, it reads 0 miles. How is this possible?"
  },
  {
    "id": "lateral_54",
    "category": "Lateral Thinking",
    "problem": "You're in a completely dark room with no windows. You have 3 identical-looking light bulbs in the room, but only 1 of them works. You also have 3 light switches outside the room, and each controls 1 bulb. You can do anything with the switches before entering the room, but once you enter, you cannot leave. How can you determine which switch controls the working bulb?"
  },
  {
    "id": "lateral_55",
    "category": "Lateral Thinking",
    "problem": "A man finds something in his pocket. He throws it away. Later, he needs the item but doesn't have a replacement. Yet he manages to meet his need. What did he throw away?"
  },
  {
    "id": "lateral_56",
    "category": "Lateral Thinking",
    "problem": "A bank robber pulls out a gun and demands money from the teller. The teller says, 'You can't fool me. I know that gun isn't real.' The robber replies, 'You're right, the gun isn't real, but the robbery is.' Nevertheless, the teller still hands over the money. Why?"
  },
  {
    "id": "lateral_57",
    "category": "Lateral Thinking",
    "problem": "A man decides to step outside his house for the first time in 30 years. When he does, he immediately dies. Why?"
  },
  {
    "id": "lateral_58",
    "category": "Lateral Thinking",
    "problem": "A woman buys 10 fish. Why are only 8 alive when she gets home?"
  },
  {
    "id": "lateral_59",
    "category": "Lateral Thinking",
    "problem": "A woman has seven children, all born in different parts of the world, on different days of the week, and at different times of day. Every one was born on February 29th. How is this possible?"
  },
  {
    "id": "lateral_60",
    "category": "Lateral Thinking",
    "problem": "A man drinks from a coconut drink and dies a few hours later. The drink wasn't poisoned, and there's no fatal illness. How did he die?"
  },
  {
    "id": "lateral_61",
    "category": "Lateral Thinking",
    "problem": "A farmer challenges an engineer, a physicist, and a mathematician to fence off the largest amount of area using the least amount of fence. The engineer makes a circular fence. The physicist makes a fence that goes around the equator. The mathematician wins. What did the mathematician do?"
  },
  {
    "id": "lateral_62",
    "category": "Lateral Thinking",
    "problem": "Two people, Maria and John, were born on the same day of the same month of the same year, to the same mother and father. But they are not twins. How is this possible?"
  },
  {
    "id": "lateral_63",
    "category": "Lateral Thinking",
    "problem": "A man went to a party and drank some of the punch. He then left early. Everyone else at the party who drank the punch subsequently died of poisoning. Why did the man not die?"
  },
  {
    "id": "lateral_64",
    "category": "Lateral Thinking",
    "problem": "A man lying dead in a field still has a bullet in his head. There are no powder marks on his clothing or body, nor any sign of having been shot at from close range, and no one heard a shot. How did he die?"
  },
  {
    "id": "lateral_65",
    "category": "Lateral Thinking",
    "problem": "A man is found dead in his study. He was slumped over his desk and a gun was in his hand. There was a cassette recorder on his desk. When the police played the cassette, they heard, 'I can't go on. I have nothing to live for.' Then they heard the sound of a gunshot. Based on this evidence, the police knew that the man had been murdered. How did they know?"
  },
  {
    "id": "lateral_66",
    "category": "Lateral Thinking",
    "problem": "A woman has 3 daughters. Each daughter has a brother. How many children does the woman have in total?"
  },
  {
    "id": "lateral_67",
    "category": "Lateral Thinking",
    "problem": "A woman doesn't have any sisters. She is playing cards. A spectator asks if the King in her hand is her King. She replies, 'No, he is my father's son.' Who is the King in her hand?"
  },
  {
    "id": "lateral_68",
    "category": "Lateral Thinking",
    "problem": "Five people have to cross a bridge. They all start on the same side. Each person walks at a different pace: the 1st takes 1 minute to cross, the 2nd takes 2 minutes, the 3rd takes 5 minutes, the 4th takes 8 minutes, and the 5th takes 10 minutes. It's night and they only have one flashlight between them. The bridge is too dangerous to cross without the flashlight, and it's only wide enough for two people at a time. When two people cross, they must walk at the slower person's pace. What is the minimum time required for all five to cross the bridge?"
  },
  {
    "id": "lateral_69",
    "category": "Lateral Thinking",
    "problem": "Robert and David were on a boat. Robert fell off, but David didn't notice that Robert was missing for a full hour. When he finally noticed, he went straight to the captain. The captain responded, 'We'll turn around. He's probably a few miles behind us now.' Sure enough, they found Robert a few miles back, treading water. How did the captain know where to find Robert?"
  },
  {
    "id": "lateral_70",
    "category": "Lateral Thinking",
    "problem": "During what month do people sleep the least?"
  },
  {
    "id": "lateral_71",
    "category": "Lateral Thinking",
    "problem": "You're in a car with a canine police officer traveling at 100km/h. A truck in front of you is going at 90km/h, and you're tailgating it. How fast is the dog going?"
  },
  {
    "id": "lateral_72",
    "category": "Lateral Thinking",
    "problem": "A woman went to the bank, but she didn't want to run out of money so she went in carefully. What was her name?"
  },
  {
    "id": "lateral_73",
    "category": "Lateral Thinking",
    "problem": "A girl is at a funeral. A guy comes up to her and they talk. She's interested, but he leaves without getting her number. She's desperate to find him, so she kills her sister. Why?"
  },
  {
    "id": "lateral_74",
    "category": "Lateral Thinking",
    "problem": "What can you put in a wooden box that would make it lighter? The more of them you put in the box, the lighter it becomes."
  },
  {
    "id": "lateral_75",
    "category": "Lateral Thinking",
    "problem": "The only entrance to a large room is through a small door that is 5 feet high. Inside the room is a huge giraffe. The giraffe is much taller than 5 feet, and the room is sealed except for the door. How did the giraffe get into the room?"
  },
  {
    "id": "lateral_76",
    "category": "Lateral Thinking",
    "problem": "I am always hungry, I must always be fed. The finger I touch will soon turn red. What am I?"
  },
  {
    "id": "lateral_77",
    "category": "Lateral Thinking",
    "problem": "A man is sitting in a pub feeling rather poor. He sees the man next to him pull out a wallet full of money. He decides to steal the wallet. He waits for the man to leave, then follows him out of the pub. Ten minutes later he returns to the pub with a satisfied smile on his face. Why doesn't he have the wallet?"
  },
  {
    "id": "lateral_78",
    "category": "Lateral Thinking",
    "problem": "A man enters a museum, sees a painting, and immediately begins to cry, saying, 'That's the most horrible thing I've ever seen!' What's going on?"
  },
  {
    "id": "lateral_79",
    "category": "Lateral Thinking",
    "problem": "A father and his son are in a horrific car accident that kills the father. The son is rushed to the hospital and ready for immediate surgery. The surgeon enters the room, looks at the patient, and says, 'I can't operate on this boy. He's my son.' How can this be?"
  },
  {
    "id": "lateral_80",
    "category": "Lateral Thinking",
    "problem": "What is the beginning of eternity, the end of time and space, the beginning of every end, and the end of every race?"
  },
  {
    "id": "lateral_81",
    "category": "Lateral Thinking",
    "problem": "A woman leaves home, turns left three times, and then returns home where she finds a man in a mask. Who is the man?"
  },
  {
    "id": "lateral_82",
    "category": "Lateral Thinking",
    "problem": "A woman is attending her mother's funeral. While there, she meets a man she has never seen before and falls in love with him at first sight. However, she forgets to ask for his name or number. A few days later she kills her sister. Why?"
  },
  {
    "id": "lateral_83",
    "category": "Lateral Thinking",
    "problem": "A man was outside taking a walk when it began to rain. The man didn't have an umbrella or a hat. His clothes got soaked, yet not a hair on his head got wet. How could this happen?"
  },
  {
    "id": "lateral_84",
    "category": "Lateral Thinking",
    "problem": "A man is driving down a country lane, when he sees a rooster sitting in the middle of the road. He slams on his brakes but still hits the rooster. The man feels terrible about what has happened. He grabs the rooster, puts it in his car, and drives to a farm he saw a mile back. He knocks on the door of the farmhouse and says, 'I'm terribly sorry, but I'm afraid I've just run over your rooster.' The woman at the door smiles and says, 'Oh, that's not our rooster. Our rooster doesn't lay eggs.' What's going on?"
  },
  {
    "id": "lateral_85",
    "category": "Lateral Thinking",
    "problem": "A man is traveling across the country. One evening, he checks into a hotel and is assigned to Room 107. At 2:00 AM, there's a knock on the door, and the hotel manager urgently asks him to move to Room 105. The man quickly relocates without asking why. The next morning, he sees several police cars at the hotel and learns that the guest in Room A was found dead. Why was the man moved from Room 107 to Room 105?"
  },
  {
    "id": "lateral_86",
    "category": "Lateral Thinking",
    "problem": "A man is discovered dead in a park. Clutched in his hand is a piece of paper. The police are called and they open the dead man's hand, revealing the piece of paper, which has written on it: '35, 118, 60, 165, 29, 131, 85, 131, 85, 7, 6, 139'. What does the series of numbers mean?"
  },
  {
    "id": "lateral_87",
    "category": "Lateral Thinking",
    "problem": "A man is found dead in a field. The only thing with him is an unopened package. How did he die?"
  },
  {
    "id": "lateral_88",
    "category": "Lateral Thinking",
    "problem": "A red house is made of red bricks, a blue house is made of blue bricks, a yellow house is made of yellow bricks. What is a greenhouse made of?"
  },
  {
    "id": "lateral_89",
    "category": "Lateral Thinking",
    "problem": "There's a man found dead in a circular mansion. The detective interviews the cook, maid, and gardener. The cook says 'I was preparing the meal.' The maid says 'I was dusting the corners.' The gardener says 'I was watering the plants.' The detective immediately arrests one of them. Which one and why?"
  },
  {
    "id": "lateral_90",
    "category": "Lateral Thinking",
    "problem": "I can run but never walk, have a mouth but never talk, have a head but never weep, have a bed but never sleep. What am I?"
  },
  {
    "id": "lateral_91",
    "category": "Lateral Thinking",
    "problem": "A man has 53 bicycles and needs to buy a new tire. What day is it?"
  },
  {
    "id": "lateral_92",
    "category": "Lateral Thinking",
    "problem": "Mark's mother has three children: Snap, Crackle, and who?"
  },
  {
    "id": "lateral_93",
    "category": "Lateral Thinking",
    "problem": "A man walks into a bar and asks for a glass of water. The bartender points a shotgun at him. The man says 'Thank you' and leaves. What happened?"
  },
  {
    "id": "lateral_94",
    "category": "Lateral Thinking",
    "problem": "A man lives on the 12th floor of an apartment building. Every morning he takes the elevator down to the lobby and leaves the building. In the evening, he gets into the elevator, and if there are other people in the elevator, he goes back to his floor directly. However, if he is alone in the elevator, he goes to the 10th floor and walks up two flights of stairs to his apartment. Why does he do this?"
  },
  {
    "id": "lateral_95",
    "category": "Lateral Thinking",
    "problem": "A woman walks into a room with a match, strikes it, and lights a cigarette. She then holds the still-burning match under a curtain, but the curtain doesn't catch fire. Why not?"
  },
  {
    "id": "lateral_96",
    "category": "Lateral Thinking",
    "problem": "How can you take 9 from 6 and get 6?"
  },
  {
    "id": "lateral_97",
    "category": "Lateral Thinking",
    "problem": "During a recent census, a man told the census taker that he had three children. When asked their ages, he replied, 'The product of their ages is 36, and the sum of their ages equals my house number.' The census taker walked outside, looked at the house number, and then said, 'I still need more information.' The man replied, 'Oh, I forgot to tell you that my oldest child likes strawberry pudding.' The census taker then knew all the children's ages. How old are they?"
  },
  {
    "id": "lateral_98",
    "category": "Lateral Thinking",
    "problem": "A boy and a doctor were fishing. The boy is the doctor's son but the doctor is not the boy's father. How can this be possible?"
  },
  {
    "id": "lateral_99",
    "category": "Lateral Thinking",
    "problem": "Why do Chinese men eat more rice than Japanese men?"
  }
]